def number_to_words(num):
    dig = [
        "",
        "один",
        "два",
        "три",
        "четыре",
        "пять",
        "шесть",
        "семь",
        "восемь",
        "девять",
    ]
    dec = [
        "",
        "десять",
        "двадцать",
        "тридцать",
        "сорок",
        "пятьдесят",
        "шестьдесят",
        "семьдесят",
        "восемьдесят",
        "девяносто",
    ]
    teen = [
        "",
        "одиннадцать",
        "двенадцать",
        "тринадцать",
        "четырнадцать",
        "пятнадцать",
        "шестнадцать",
        "семнадцать",
        "восемнадцать",
        "девятнадцать",
    ]
    if num < 10:
        return dig[num]
    if 11 <= num <= 19:
        return teen[num - 10]
    if num >= 20 or num == 10:
        n1 = num // 10
        n2 = num % 10
        s = dec[n1] + " " + dig[n2]
        return s


n = int(input())

print(number_to_words(n))
